android-app-development/index.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2026-01-21 Wed 22:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Mobile Application Development</title>
<meta name="generator" content="Org Mode" />
<meta charset="UTF-8">
<meta name="viewport" content="width=device-width, initial-scale=1, maximum-scale=1, user-scalable=no">
<meta property="og:image" content="https://notes.compileartisan.dev/assets/og-image.png">
<meta property="og:image:width" content="1200">
<meta property="og:image:height" content="630">
<meta property="og:type" content="website">
<meta property="og:title" content="%TITLE%">
<meta property="og:description" content="Notes from CompileArtisan">
<meta property="og:url" content="https://notes.compileartisan.dev">
<meta name="twitter:card" content="summary_large_image">
<meta name="twitter:image" content="https://notes.compileartisan.dev/assets/og-image.png">
<div class="header">
<a href="https://compileartisan.pages.dev/">CompileArtisan</a>
</div>
</head>
<body>
<div id="content" class="content">
<h1 class="title">Mobile Application Development</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgd656b40">1. Prelude</a></li>
<li><a href="#orgee71252">2. How the App works</a>
<ul>
<li><a href="#org94150dd">2.1. Activity</a></li>
<li><a href="#org538f386">2.2. XML Files</a></li>
</ul>
</li>
<li><a href="#orgcf34922">3. Basic Addition</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgd656b40" class="outline-2">
<h2 id="orgd656b40"><span class="section-number-2">1.</span> Prelude</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li>These notes don&rsquo;t include Android Studio tutorials as:
<ol class="org-ol">
<li>Graphical tutorials are a lot of effort</li>
<li>Android Studio keeps evolving so it&rsquo;s going to be different when you&rsquo;re
reading this.</li>
</ol></li>
</ul>
</div>
</div>
<div id="outline-container-orgee71252" class="outline-2">
<h2 id="orgee71252"><span class="section-number-2">2.</span> How the App works</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org94150dd" class="outline-3">
<h3 id="org94150dd"><span class="section-number-3">2.1.</span> Activity</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li>A Java Class that serves as a controller for a specific screen, is called an
activity.</li>
<li>Such a Java Class must <code>extend Activity</code> (basic <a href="https://developer.android.com/guide/components/activities/activity-lifecycle">activity lifecycle</a> features
provided here) or <code>extend AppCompatActivity</code> (this is preferred because modern
Android features are backported to older versions too). <code>AppCompatActivity</code>
extends <code>FragmentActivity</code> which extends <code>ComponentActivity</code> which extends
<code>Activity</code>.</li>
<li>The screen that the app starts with, is controlled with the help of the
<code>MainActivity.java</code> file.</li>
</ul>
</div>
</div>
<div id="outline-container-org538f386" class="outline-3">
<h3 id="org538f386"><span class="section-number-3">2.2.</span> XML Files</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>All of the components of the UI of a particular screen is created using an XML
file or a group of XML files.</li>
<li>Such a component is called a <b>view</b>.</li>
<li>Each view will have an <code>id</code> (an integer), which can be accessed in a Java Class
as <code>R.id.nameOfID</code>, where <code>R</code> is a <code>final class</code> created by Android at build time.</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-orgcf34922" class="outline-2">
<h2 id="orgcf34922"><span class="section-number-2">3.</span> Basic Addition</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>This code follows from <a href="https://www.youtube.com/watch?v=4hEsnJPoP4s">this video</a>.</li>
</ul>

<div class="org-src-container">
<pre class="src src-java"><span style="color: #51afef;">public</span> <span style="color: #51afef;">class</span> <span style="color: #ECBE7B;">MainActivity</span> <span style="color: #51afef;">extends</span> <span style="color: #ECBE7B;">AppCompatActivity</span> {
<span style="color: #3dea43364a63;"> </span>   <span style="color: #5B6268;">// </span><span style="color: #5B6268;">declare these variables
</span><span style="color: #3dea43364a63;"> </span>   <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">EditText</span> <span style="color: #dcaeea;">num1</span>, <span style="color: #dcaeea;">num2</span>;
<span style="color: #3dea43364a63;"> </span>   <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">Button</span> <span style="color: #dcaeea;">add</span>;
<span style="color: #3dea43364a63;"> </span>   <span style="color: #51afef;">private</span> <span style="color: #ECBE7B;">TextView</span> <span style="color: #dcaeea;">result</span>;
 
<span style="color: #3dea43364a63;"> </span>   <span style="color: #a9a1e1;">@Override</span>
<span style="color: #3dea43364a63;"> </span>   <span style="color: #51afef;">protected</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">onCreate</span>(<span style="color: #ECBE7B;">Bundle</span> <span style="color: #dcaeea;">savedInstanceState</span>) {
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #5B6268;">// </span><span style="color: #5B6268;">some code already here, just add the below code
     
</span><span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   num1 = (<span style="color: #ECBE7B;">EditText</span>) findViewById(R.id.no1);
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   num2 = (<span style="color: #ECBE7B;">EditText</span>) findViewById(R.id.no2);
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   result = (<span style="color: #ECBE7B;">TextView</span>) findViewById(R.id.result);
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   add = (<span style="color: #ECBE7B;">Button</span>) findViewById(R.id.addButton);
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   add.setOnClickListener(<span style="color: #51afef;">new</span> <span style="color: #a9a1e1;">View</span>.<span style="color: #ECBE7B;">OnClickListener</span>() {
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #a9a1e1;">@Override</span>
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #51afef;">public</span> <span style="color: #ECBE7B;">void</span> <span style="color: #c678dd;">onClick</span>(<span style="color: #ECBE7B;">View</span> <span style="color: #dcaeea;">v</span>) {
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   result.setText(String.valueOf(
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   Integer.parseInt(num1.getText().toString())
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   + Integer.parseInt(num2.getText().toString())
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   ));
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   }
<span style="color: #3dea43364a63;"> </span>   <span style="color: #3dea43364a63;"> </span>   });
     
<span style="color: #3dea43364a63;"> </span>   }
}

</pre>
</div>
</div>
</div>
</div>
</body>
</html>
